{
	// The keys that can be used to toggle the terminal.
	// See "HotKeys" bellow for possible values.
	"HotKeys": [
		{
			"Modifiers": "Control",
			"Key": "OemTilde"
		},
		{
			"Modifiers": "Control",
			"Key": "Q"
		}
	],

	// Whether to show notifications when the app starts and when the settings are reloaded.
	"Notifications": true,

	// Make the window see-through (applies to the entire window, including the title bar).
	// 0 (invisible) - 100 (opaque)
	"Opacity": 80,

	// How long the toggle up/down takes in milliseconds.
	"ToggleDurationMs": 250,

	// How long each frame in the toggle animation takes in milliseconds.
	// The lower this value, the smoother the animation, though values lower than 15 are not supported.
	"ToggleAnimationFrameTimeMs": 25,

	// How much room to leave between the top of the terminal and the top of the screen.
	"VerticalOffset": 0,

	// How far the terminal should come down, in percentage (eg. 50 = half way, 100 = full screen).
	"VerticalScreenCoverage": 80,

	// When "HorizontalScreenCoverage" is below 100, this setting determines where the terminal is place horizontally.
	// "Center", "Left" or "Right".
	"HorizontalAlign": "Center",

	// How much horizontal space the terminal should use. When this is below 100, the terminal is centered.
	// This can also be above 100, which can be useful to compensate for the window not always taking a 100% of the screen width,
	// due to the terminal being bound to column widths (eg. try 100.5 or 101).
	"HorizontalScreenCoverage": 100,

	// When clicking or alt-tabbing away to another app, the terminal will automatically (and instantly) hide.
	"HideOnFocusLost": true,

	// Whether to keep the terminal window always on top (requires restart).
	"AlwaysOnTop": false,

	// Whether to hide the terminal window immediately after app start.
	"StartHidden": false,

	// What monitor to preferrably drop the terminal
	// "WithCursor" (default), "Primary" or "AtIndex"
	"PreferMonitor": "WithCursor",

	// If "PreferMonitor" is set to "AtIndex", this setting determines what monitor to choose.
	// Zero based, eg. 0, 1, etc.
	"MonitorIndex": 1

	// # HotKeys
	// ## Modifiers
	// Alt, Control, Shift, Windows
	//
	// ## Key
	// ### Special keys
	// Alt, Back, CapsLock, Control, Escape, LControlKey, LShiftKey, LWin, RControlKey, RShiftKey, RWin, Shift, Space, Tab
	//
	// ### Middle part of the keyboard
	// Delete, End, Home, Insert, PageDown, PageUp, PrintScreen
	// Down, Left, Right, Up
	//
	// ### Number keys
	// D0 - D9
	//
	// ### Letters
	// A-Z
	//
	// ### Numpad
	// NumPad0 - NumPad9
	// Add, Decimal, Divide, Multiply, NumLock, Separator, Subtract
	//
	// ### Function keys
	// F1 - F24
	//
	// ### Special characters
	// OemBackslash, OemClear, OemCloseBrackets, Oemcomma, OemMinus, OemOpenBrackets,
	// OemPeriod, OemPipe, Oemplus, OemQuestion, OemQuotes, OemSemicolon, Oemtilde
	// Oem1 - Oem8, Oem102
}